# pandas 2

In [4]:
import pandas as pd

In [93]:
# set de datos
# el index es opcional. Pandas genera un index en forma automática, en caso de que no sea provisto
data = [
    [ "Pedro",   11, "Italia",     4.5, "Europa"  ],
    [ "Pablo",   33, "Argentina",  5.1, "América" ],
    [ "José",    22, "Inglaterra", 7.2, "Europa"  ],
    [ "María",   55, "Argentina",  3.5, "América" ],
    [ "Celeste", 22, "España",     3.3, "Europa"  ],   
]
cols = ["nombre", "edad", "nacionalidad", "puntaje", "continente"]
df = pd.DataFrame(data=data, columns=cols)

In [13]:
df

    nombre  edad nacionalidad  puntaje continente
0    Pedro    11       Italia      4.5     Europa
1    Pablo    33    Argentina      5.1    América
2     José    22   Inglaterra      7.2     Europa
3    María    55    Argentina      3.5    América
4  Celeste    22       España      3.3     Europa

1- obtener una vista con unicamente la col de nombre y edad

In [18]:
df[["nombre", "edad"]]
df.loc[:, ["nombre", "edad"]]

    nombre  edad
0    Pedro    11
1    Pablo    33
2     José    22
3    María    55
4  Celeste    22

2- quedarse con las filas 1 a 3

In [21]:
df.loc[1:3, ["nombre", "edad"]]

  nombre  edad
1  Pablo    33
2   José    22
3  María    55

3- filtrar mayores a 22 años

In [39]:
nye = df["edad"]
df.loc[nye > 22, ["nombre", "edad"]]

  nombre  edad
1  Pablo    33
3  María    55

4- duplicar puntaje de filas de America

In [94]:
america = df.loc[df["continente"] == "América", "puntaje"] * 2 
df.loc[america.index, "puntaje"] = america
df

    nombre  edad nacionalidad  puntaje continente
0    Pedro    11       Italia      4.5     Europa
1    Pablo    33    Argentina     10.2    América
2     José    22   Inglaterra      7.2     Europa
3    María    55    Argentina      7.0    América
4  Celeste    22       España      3.3     Europa